bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/mjpeg_reg.h
/**
  ******************************************************************************
  * @file    mjpeg_reg.h
  * @version V1.2
  * @date    2020-03-30
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2019 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __MJPEG_REG_H__
#define __MJPEG_REG_H__

#include "bl702l.h"

/* 0x0 : mjpeg_control_1 */
#define MJPEG_CONTROL_1_OFFSET          (0x0)
#define MJPEG_REG_MJPEG_ENABLE          MJPEG_REG_MJPEG_ENABLE
#define MJPEG_REG_MJPEG_ENABLE_POS      (0U)
#define MJPEG_REG_MJPEG_ENABLE_LEN      (1U)
#define MJPEG_REG_MJPEG_ENABLE_MSK      (((1U << MJPEG_REG_MJPEG_ENABLE_LEN) - 1) << MJPEG_REG_MJPEG_ENABLE_POS)
#define MJPEG_REG_MJPEG_ENABLE_UMSK     (~(((1U << MJPEG_REG_MJPEG_ENABLE_LEN) - 1) << MJPEG_REG_MJPEG_ENABLE_POS))
#define MJPEG_REG_MJPEG_BIT_ORDER       MJPEG_REG_MJPEG_BIT_ORDER
#define MJPEG_REG_MJPEG_BIT_ORDER_POS   (1U)
#define MJPEG_REG_MJPEG_BIT_ORDER_LEN   (1U)
#define MJPEG_REG_MJPEG_BIT_ORDER_MSK   (((1U << MJPEG_REG_MJPEG_BIT_ORDER_LEN) - 1) << MJPEG_REG_MJPEG_BIT_ORDER_POS)
#define MJPEG_REG_MJPEG_BIT_ORDER_UMSK  (~(((1U << MJPEG_REG_MJPEG_BIT_ORDER_LEN) - 1) << MJPEG_REG_MJPEG_BIT_ORDER_POS))
#define MJPEG_REG_ORDER_U_EVEN          MJPEG_REG_ORDER_U_EVEN
#define MJPEG_REG_ORDER_U_EVEN_POS      (2U)
#define MJPEG_REG_ORDER_U_EVEN_LEN      (1U)
#define MJPEG_REG_ORDER_U_EVEN_MSK      (((1U << MJPEG_REG_ORDER_U_EVEN_LEN) - 1) << MJPEG_REG_ORDER_U_EVEN_POS)
#define MJPEG_REG_ORDER_U_EVEN_UMSK     (~(((1U << MJPEG_REG_ORDER_U_EVEN_LEN) - 1) << MJPEG_REG_ORDER_U_EVEN_POS))
#define MJPEG_REG_WR_OVER_STOP          MJPEG_REG_WR_OVER_STOP
#define MJPEG_REG_WR_OVER_STOP_POS      (3U)
#define MJPEG_REG_WR_OVER_STOP_LEN      (1U)
#define MJPEG_REG_WR_OVER_STOP_MSK      (((1U << MJPEG_REG_WR_OVER_STOP_LEN) - 1) << MJPEG_REG_WR_OVER_STOP_POS)
#define MJPEG_REG_WR_OVER_STOP_UMSK     (~(((1U << MJPEG_REG_WR_OVER_STOP_LEN) - 1) << MJPEG_REG_WR_OVER_STOP_POS))
#define MJPEG_REG_LAST_HF_WBLK_DMY      MJPEG_REG_LAST_HF_WBLK_DMY
#define MJPEG_REG_LAST_HF_WBLK_DMY_POS  (4U)
#define MJPEG_REG_LAST_HF_WBLK_DMY_LEN  (1U)
#define MJPEG_REG_LAST_HF_WBLK_DMY_MSK  (((1U << MJPEG_REG_LAST_HF_WBLK_DMY_LEN) - 1) << MJPEG_REG_LAST_HF_WBLK_DMY_POS)
#define MJPEG_REG_LAST_HF_WBLK_DMY_UMSK (~(((1U << MJPEG_REG_LAST_HF_WBLK_DMY_LEN) - 1) << MJPEG_REG_LAST_HF_WBLK_DMY_POS))
#define MJPEG_REG_LAST_HF_HBLK_DMY      MJPEG_REG_LAST_HF_HBLK_DMY
#define MJPEG_REG_LAST_HF_HBLK_DMY_POS  (5U)
#define MJPEG_REG_LAST_HF_HBLK_DMY_LEN  (1U)
#define MJPEG_REG_LAST_HF_HBLK_DMY_MSK  (((1U << MJPEG_REG_LAST_HF_HBLK_DMY_LEN) - 1) << MJPEG_REG_LAST_HF_HBLK_DMY_POS)
#define MJPEG_REG_LAST_HF_HBLK_DMY_UMSK (~(((1U << MJPEG_REG_LAST_HF_HBLK_DMY_LEN) - 1) << MJPEG_REG_LAST_HF_HBLK_DMY_POS))
#define MJPEG_REG_REFLECT_DMY           MJPEG_REG_REFLECT_DMY
#define MJPEG_REG_REFLECT_DMY_POS       (6U)
#define MJPEG_REG_REFLECT_DMY_LEN       (1U)
#define MJPEG_REG_REFLECT_DMY_MSK       (((1U << MJPEG_REG_REFLECT_DMY_LEN) - 1) << MJPEG_REG_REFLECT_DMY_POS)
#define MJPEG_REG_REFLECT_DMY_UMSK      (~(((1U << MJPEG_REG_REFLECT_DMY_LEN) - 1) << MJPEG_REG_REFLECT_DMY_POS))
#define MJPEG_REG_H_BUST                MJPEG_REG_H_BUST
#define MJPEG_REG_H_BUST_POS            (8U)
#define MJPEG_REG_H_BUST_LEN            (2U)
#define MJPEG_REG_H_BUST_MSK            (((1U << MJPEG_REG_H_BUST_LEN) - 1) << MJPEG_REG_H_BUST_POS)
#define MJPEG_REG_H_BUST_UMSK           (~(((1U << MJPEG_REG_H_BUST_LEN) - 1) << MJPEG_REG_H_BUST_POS))
#define MJPEG_REG_YUV_MODE              MJPEG_REG_YUV_MODE
#define MJPEG_REG_YUV_MODE_POS          (12U)
#define MJPEG_REG_YUV_MODE_LEN          (2U)
#define MJPEG_REG_YUV_MODE_MSK          (((1U << MJPEG_REG_YUV_MODE_LEN) - 1) << MJPEG_REG_YUV_MODE_POS)
#define MJPEG_REG_YUV_MODE_UMSK         (~(((1U << MJPEG_REG_YUV_MODE_LEN) - 1) << MJPEG_REG_YUV_MODE_POS))
#define MJPEG_REG_Q_MODE                MJPEG_REG_Q_MODE
#define MJPEG_REG_Q_MODE_POS            (16U)
#define MJPEG_REG_Q_MODE_LEN            (7U)
#define MJPEG_REG_Q_MODE_MSK            (((1U << MJPEG_REG_Q_MODE_LEN) - 1) << MJPEG_REG_Q_MODE_POS)
#define MJPEG_REG_Q_MODE_UMSK           (~(((1U << MJPEG_REG_Q_MODE_LEN) - 1) << MJPEG_REG_Q_MODE_POS))
#define MJPEG_REG_Y0_ORDER              MJPEG_REG_Y0_ORDER
#define MJPEG_REG_Y0_ORDER_POS          (24U)
#define MJPEG_REG_Y0_ORDER_LEN          (2U)
#define MJPEG_REG_Y0_ORDER_MSK          (((1U << MJPEG_REG_Y0_ORDER_LEN) - 1) << MJPEG_REG_Y0_ORDER_POS)
#define MJPEG_REG_Y0_ORDER_UMSK         (~(((1U << MJPEG_REG_Y0_ORDER_LEN) - 1) << MJPEG_REG_Y0_ORDER_POS))
#define MJPEG_REG_U0_ORDER              MJPEG_REG_U0_ORDER
#define MJPEG_REG_U0_ORDER_POS          (26U)
#define MJPEG_REG_U0_ORDER_LEN          (2U)
#define MJPEG_REG_U0_ORDER_MSK          (((1U << MJPEG_REG_U0_ORDER_LEN) - 1) << MJPEG_REG_U0_ORDER_POS)
#define MJPEG_REG_U0_ORDER_UMSK         (~(((1U << MJPEG_REG_U0_ORDER_LEN) - 1) << MJPEG_REG_U0_ORDER_POS))
#define MJPEG_REG_Y1_ORDER              MJPEG_REG_Y1_ORDER
#define MJPEG_REG_Y1_ORDER_POS          (28U)
#define MJPEG_REG_Y1_ORDER_LEN          (2U)
#define MJPEG_REG_Y1_ORDER_MSK          (((1U << MJPEG_REG_Y1_ORDER_LEN) - 1) << MJPEG_REG_Y1_ORDER_POS)
#define MJPEG_REG_Y1_ORDER_UMSK         (~(((1U << MJPEG_REG_Y1_ORDER_LEN) - 1) << MJPEG_REG_Y1_ORDER_POS))
#define MJPEG_REG_V0_ORDER              MJPEG_REG_V0_ORDER
#define MJPEG_REG_V0_ORDER_POS          (30U)
#define MJPEG_REG_V0_ORDER_LEN          (2U)
#define MJPEG_REG_V0_ORDER_MSK          (((1U << MJPEG_REG_V0_ORDER_LEN) - 1) << MJPEG_REG_V0_ORDER_POS)
#define MJPEG_REG_V0_ORDER_UMSK         (~(((1U << MJPEG_REG_V0_ORDER_LEN) - 1) << MJPEG_REG_V0_ORDER_POS))

/* 0x4 : mjpeg_control_2 */
#define MJPEG_CONTROL_2_OFFSET          (0x4)
#define MJPEG_REG_SW_FRAME              MJPEG_REG_SW_FRAME
#define MJPEG_REG_SW_FRAME_POS          (0U)
#define MJPEG_REG_SW_FRAME_LEN          (5U)
#define MJPEG_REG_SW_FRAME_MSK          (((1U << MJPEG_REG_SW_FRAME_LEN) - 1) << MJPEG_REG_SW_FRAME_POS)
#define MJPEG_REG_SW_FRAME_UMSK         (~(((1U << MJPEG_REG_SW_FRAME_LEN) - 1) << MJPEG_REG_SW_FRAME_POS))
#define MJPEG_REG_MJPEG_SW_MODE         MJPEG_REG_MJPEG_SW_MODE
#define MJPEG_REG_MJPEG_SW_MODE_POS     (8U)
#define MJPEG_REG_MJPEG_SW_MODE_LEN     (1U)
#define MJPEG_REG_MJPEG_SW_MODE_MSK     (((1U << MJPEG_REG_MJPEG_SW_MODE_LEN) - 1) << MJPEG_REG_MJPEG_SW_MODE_POS)
#define MJPEG_REG_MJPEG_SW_MODE_UMSK    (~(((1U << MJPEG_REG_MJPEG_SW_MODE_LEN) - 1) << MJPEG_REG_MJPEG_SW_MODE_POS))
#define MJPEG_REG_MJPEG_SW_RUN          MJPEG_REG_MJPEG_SW_RUN
#define MJPEG_REG_MJPEG_SW_RUN_POS      (9U)
#define MJPEG_REG_MJPEG_SW_RUN_LEN      (1U)
#define MJPEG_REG_MJPEG_SW_RUN_MSK      (((1U << MJPEG_REG_MJPEG_SW_RUN_LEN) - 1) << MJPEG_REG_MJPEG_SW_RUN_POS)
#define MJPEG_REG_MJPEG_SW_RUN_UMSK     (~(((1U << MJPEG_REG_MJPEG_SW_RUN_LEN) - 1) << MJPEG_REG_MJPEG_SW_RUN_POS))
#define MJPEG_REG_YY_DVP2AHB_LSEL       MJPEG_REG_YY_DVP2AHB_LSEL
#define MJPEG_REG_YY_DVP2AHB_LSEL_POS   (12U)
#define MJPEG_REG_YY_DVP2AHB_LSEL_LEN   (1U)
#define MJPEG_REG_YY_DVP2AHB_LSEL_MSK   (((1U << MJPEG_REG_YY_DVP2AHB_LSEL_LEN) - 1) << MJPEG_REG_YY_DVP2AHB_LSEL_POS)
#define MJPEG_REG_YY_DVP2AHB_LSEL_UMSK  (~(((1U << MJPEG_REG_YY_DVP2AHB_LSEL_LEN) - 1) << MJPEG_REG_YY_DVP2AHB_LSEL_POS))
#define MJPEG_REG_YY_DVP2AHB_FSEL       MJPEG_REG_YY_DVP2AHB_FSEL
#define MJPEG_REG_YY_DVP2AHB_FSEL_POS   (13U)
#define MJPEG_REG_YY_DVP2AHB_FSEL_LEN   (1U)
#define MJPEG_REG_YY_DVP2AHB_FSEL_MSK   (((1U << MJPEG_REG_YY_DVP2AHB_FSEL_LEN) - 1) << MJPEG_REG_YY_DVP2AHB_FSEL_POS)
#define MJPEG_REG_YY_DVP2AHB_FSEL_UMSK  (~(((1U << MJPEG_REG_YY_DVP2AHB_FSEL_LEN) - 1) << MJPEG_REG_YY_DVP2AHB_FSEL_POS))
#define MJPEG_REG_UV_DVP2AHB_LSEL       MJPEG_REG_UV_DVP2AHB_LSEL
#define MJPEG_REG_UV_DVP2AHB_LSEL_POS   (14U)
#define MJPEG_REG_UV_DVP2AHB_LSEL_LEN   (1U)
#define MJPEG_REG_UV_DVP2AHB_LSEL_MSK   (((1U << MJPEG_REG_UV_DVP2AHB_LSEL_LEN) - 1) << MJPEG_REG_UV_DVP2AHB_LSEL_POS)
#define MJPEG_REG_UV_DVP2AHB_LSEL_UMSK  (~(((1U << MJPEG_REG_UV_DVP2AHB_LSEL_LEN) - 1) << MJPEG_REG_UV_DVP2AHB_LSEL_POS))
#define MJPEG_REG_UV_DVP2AHB_FSEL       MJPEG_REG_UV_DVP2AHB_FSEL
#define MJPEG_REG_UV_DVP2AHB_FSEL_POS   (15U)
#define MJPEG_REG_UV_DVP2AHB_FSEL_LEN   (1U)
#define MJPEG_REG_UV_DVP2AHB_FSEL_MSK   (((1U << MJPEG_REG_UV_DVP2AHB_FSEL_LEN) - 1) << MJPEG_REG_UV_DVP2AHB_FSEL_POS)
#define MJPEG_REG_UV_DVP2AHB_FSEL_UMSK  (~(((1U << MJPEG_REG_UV_DVP2AHB_FSEL_LEN) - 1) << MJPEG_REG_UV_DVP2AHB_FSEL_POS))
#define MJPEG_REG_MJPEG_WAIT_CYCLE      MJPEG_REG_MJPEG_WAIT_CYCLE
#define MJPEG_REG_MJPEG_WAIT_CYCLE_POS  (16U)
#define MJPEG_REG_MJPEG_WAIT_CYCLE_LEN  (16U)
#define MJPEG_REG_MJPEG_WAIT_CYCLE_MSK  (((1U << MJPEG_REG_MJPEG_WAIT_CYCLE_LEN) - 1) << MJPEG_REG_MJPEG_WAIT_CYCLE_POS)
#define MJPEG_REG_MJPEG_WAIT_CYCLE_UMSK (~(((1U << MJPEG_REG_MJPEG_WAIT_CYCLE_LEN) - 1) << MJPEG_REG_MJPEG_WAIT_CYCLE_POS))

/* 0x08 : mjpeg_yy_frame_addr */
#define MJPEG_YY_FRAME_ADDR_OFFSET   (0x08)
#define MJPEG_REG_YY_ADDR_START      MJPEG_REG_YY_ADDR_START
#define MJPEG_REG_YY_ADDR_START_POS  (0U)
#define MJPEG_REG_YY_ADDR_START_LEN  (32U)
#define MJPEG_REG_YY_ADDR_START_MSK  (((1U << MJPEG_REG_YY_ADDR_START_LEN) - 1) << MJPEG_REG_YY_ADDR_START_POS)
#define MJPEG_REG_YY_ADDR_START_UMSK (~(((1U << MJPEG_REG_YY_ADDR_START_LEN) - 1) << MJPEG_REG_YY_ADDR_START_POS))

