bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/mjpeg_reg.h
/* 0x88 : mjpeg_start_addr1 */
#define MJPEG_START_ADDR1_OFFSET      (0x88)
#define MJPEG_FRAME_START_ADDR_1      MJPEG_FRAME_START_ADDR_1
#define MJPEG_FRAME_START_ADDR_1_POS  (0U)
#define MJPEG_FRAME_START_ADDR_1_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_1_MSK  (((1U << MJPEG_FRAME_START_ADDR_1_LEN) - 1) << MJPEG_FRAME_START_ADDR_1_POS)
#define MJPEG_FRAME_START_ADDR_1_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_1_LEN) - 1) << MJPEG_FRAME_START_ADDR_1_POS))

/* 0x8C : mjpeg_bit_cnt1 */
#define MJPEG_BIT_CNT1_OFFSET      (0x8C)
#define MJPEG_FRAME_BIT_CNT_1      MJPEG_FRAME_BIT_CNT_1
#define MJPEG_FRAME_BIT_CNT_1_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_1_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_1_MSK  (((1U << MJPEG_FRAME_BIT_CNT_1_LEN) - 1) << MJPEG_FRAME_BIT_CNT_1_POS)
#define MJPEG_FRAME_BIT_CNT_1_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_1_LEN) - 1) << MJPEG_FRAME_BIT_CNT_1_POS))

/* 0x90 : mjpeg_start_addr2 */
#define MJPEG_START_ADDR2_OFFSET      (0x90)
#define MJPEG_FRAME_START_ADDR_2      MJPEG_FRAME_START_ADDR_2
#define MJPEG_FRAME_START_ADDR_2_POS  (0U)
#define MJPEG_FRAME_START_ADDR_2_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_2_MSK  (((1U << MJPEG_FRAME_START_ADDR_2_LEN) - 1) << MJPEG_FRAME_START_ADDR_2_POS)
#define MJPEG_FRAME_START_ADDR_2_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_2_LEN) - 1) << MJPEG_FRAME_START_ADDR_2_POS))

/* 0x94 : mjpeg_bit_cnt2 */
#define MJPEG_BIT_CNT2_OFFSET      (0x94)
#define MJPEG_FRAME_BIT_CNT_2      MJPEG_FRAME_BIT_CNT_2
#define MJPEG_FRAME_BIT_CNT_2_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_2_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_2_MSK  (((1U << MJPEG_FRAME_BIT_CNT_2_LEN) - 1) << MJPEG_FRAME_BIT_CNT_2_POS)
#define MJPEG_FRAME_BIT_CNT_2_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_2_LEN) - 1) << MJPEG_FRAME_BIT_CNT_2_POS))

/* 0x98 : mjpeg_start_addr3 */
#define MJPEG_START_ADDR3_OFFSET      (0x98)
#define MJPEG_FRAME_START_ADDR_3      MJPEG_FRAME_START_ADDR_3
#define MJPEG_FRAME_START_ADDR_3_POS  (0U)
#define MJPEG_FRAME_START_ADDR_3_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_3_MSK  (((1U << MJPEG_FRAME_START_ADDR_3_LEN) - 1) << MJPEG_FRAME_START_ADDR_3_POS)
#define MJPEG_FRAME_START_ADDR_3_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_3_LEN) - 1) << MJPEG_FRAME_START_ADDR_3_POS))

/* 0x9C : mjpeg_bit_cnt3 */
#define MJPEG_BIT_CNT3_OFFSET      (0x9C)
#define MJPEG_FRAME_BIT_CNT_3      MJPEG_FRAME_BIT_CNT_3
#define MJPEG_FRAME_BIT_CNT_3_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_3_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_3_MSK  (((1U << MJPEG_FRAME_BIT_CNT_3_LEN) - 1) << MJPEG_FRAME_BIT_CNT_3_POS)
#define MJPEG_FRAME_BIT_CNT_3_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_3_LEN) - 1) << MJPEG_FRAME_BIT_CNT_3_POS))

/* 0xA0 : mjpeg_start_addr4 */
#define MJPEG_START_ADDR4_OFFSET      (0xA0)
#define MJPEG_FRAME_START_ADDR_4      MJPEG_FRAME_START_ADDR_4
#define MJPEG_FRAME_START_ADDR_4_POS  (0U)
#define MJPEG_FRAME_START_ADDR_4_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_4_MSK  (((1U << MJPEG_FRAME_START_ADDR_4_LEN) - 1) << MJPEG_FRAME_START_ADDR_4_POS)
#define MJPEG_FRAME_START_ADDR_4_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_4_LEN) - 1) << MJPEG_FRAME_START_ADDR_4_POS))

/* 0xA4 : mjpeg_bit_cnt4 */
#define MJPEG_BIT_CNT4_OFFSET      (0xA4)
#define MJPEG_FRAME_BIT_CNT_4      MJPEG_FRAME_BIT_CNT_4
#define MJPEG_FRAME_BIT_CNT_4_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_4_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_4_MSK  (((1U << MJPEG_FRAME_BIT_CNT_4_LEN) - 1) << MJPEG_FRAME_BIT_CNT_4_POS)
#define MJPEG_FRAME_BIT_CNT_4_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_4_LEN) - 1) << MJPEG_FRAME_BIT_CNT_4_POS))

/* 0xA8 : mjpeg_start_addr5 */
#define MJPEG_START_ADDR5_OFFSET      (0xA8)
#define MJPEG_FRAME_START_ADDR_5      MJPEG_FRAME_START_ADDR_5
#define MJPEG_FRAME_START_ADDR_5_POS  (0U)
#define MJPEG_FRAME_START_ADDR_5_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_5_MSK  (((1U << MJPEG_FRAME_START_ADDR_5_LEN) - 1) << MJPEG_FRAME_START_ADDR_5_POS)
#define MJPEG_FRAME_START_ADDR_5_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_5_LEN) - 1) << MJPEG_FRAME_START_ADDR_5_POS))

/* 0xAC : mjpeg_bit_cnt5 */
#define MJPEG_BIT_CNT5_OFFSET      (0xAC)
#define MJPEG_FRAME_BIT_CNT_5      MJPEG_FRAME_BIT_CNT_5
#define MJPEG_FRAME_BIT_CNT_5_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_5_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_5_MSK  (((1U << MJPEG_FRAME_BIT_CNT_5_LEN) - 1) << MJPEG_FRAME_BIT_CNT_5_POS)
#define MJPEG_FRAME_BIT_CNT_5_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_5_LEN) - 1) << MJPEG_FRAME_BIT_CNT_5_POS))

/* 0xB0 : mjpeg_start_addr6 */
#define MJPEG_START_ADDR6_OFFSET      (0xB0)
#define MJPEG_FRAME_START_ADDR_6      MJPEG_FRAME_START_ADDR_6
#define MJPEG_FRAME_START_ADDR_6_POS  (0U)
#define MJPEG_FRAME_START_ADDR_6_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_6_MSK  (((1U << MJPEG_FRAME_START_ADDR_6_LEN) - 1) << MJPEG_FRAME_START_ADDR_6_POS)
#define MJPEG_FRAME_START_ADDR_6_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_6_LEN) - 1) << MJPEG_FRAME_START_ADDR_6_POS))

/* 0xB4 : mjpeg_bit_cnt6 */
#define MJPEG_BIT_CNT6_OFFSET      (0xB4)
#define MJPEG_FRAME_BIT_CNT_6      MJPEG_FRAME_BIT_CNT_6
#define MJPEG_FRAME_BIT_CNT_6_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_6_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_6_MSK  (((1U << MJPEG_FRAME_BIT_CNT_6_LEN) - 1) << MJPEG_FRAME_BIT_CNT_6_POS)
#define MJPEG_FRAME_BIT_CNT_6_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_6_LEN) - 1) << MJPEG_FRAME_BIT_CNT_6_POS))

/* 0xB8 : mjpeg_start_addr7 */
#define MJPEG_START_ADDR7_OFFSET      (0xB8)
#define MJPEG_FRAME_START_ADDR_7      MJPEG_FRAME_START_ADDR_7
#define MJPEG_FRAME_START_ADDR_7_POS  (0U)
#define MJPEG_FRAME_START_ADDR_7_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_7_MSK  (((1U << MJPEG_FRAME_START_ADDR_7_LEN) - 1) << MJPEG_FRAME_START_ADDR_7_POS)
#define MJPEG_FRAME_START_ADDR_7_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_7_LEN) - 1) << MJPEG_FRAME_START_ADDR_7_POS))

/* 0xBC : mjpeg_bit_cnt7 */
#define MJPEG_BIT_CNT7_OFFSET      (0xBC)
#define MJPEG_FRAME_BIT_CNT_7      MJPEG_FRAME_BIT_CNT_7
#define MJPEG_FRAME_BIT_CNT_7_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_7_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_7_MSK  (((1U << MJPEG_FRAME_BIT_CNT_7_LEN) - 1) << MJPEG_FRAME_BIT_CNT_7_POS)
#define MJPEG_FRAME_BIT_CNT_7_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_7_LEN) - 1) << MJPEG_FRAME_BIT_CNT_7_POS))

