bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/mjpeg_reg.h
/* 0x120 : mjpeg_q_mode_8 */
#define MJPEG_Q_MODE_8_OFFSET     (0x120)
#define MJPEG_FRAME_Q_MODE_8      MJPEG_FRAME_Q_MODE_8
#define MJPEG_FRAME_Q_MODE_8_POS  (0U)
#define MJPEG_FRAME_Q_MODE_8_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_8_MSK  (((1U << MJPEG_FRAME_Q_MODE_8_LEN) - 1) << MJPEG_FRAME_Q_MODE_8_POS)
#define MJPEG_FRAME_Q_MODE_8_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_8_LEN) - 1) << MJPEG_FRAME_Q_MODE_8_POS))

/* 0x124 : mjpeg_q_mode_9 */
#define MJPEG_Q_MODE_9_OFFSET     (0x124)
#define MJPEG_FRAME_Q_MODE_9      MJPEG_FRAME_Q_MODE_9
#define MJPEG_FRAME_Q_MODE_9_POS  (0U)
#define MJPEG_FRAME_Q_MODE_9_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_9_MSK  (((1U << MJPEG_FRAME_Q_MODE_9_LEN) - 1) << MJPEG_FRAME_Q_MODE_9_POS)
#define MJPEG_FRAME_Q_MODE_9_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_9_LEN) - 1) << MJPEG_FRAME_Q_MODE_9_POS))

/* 0x128 : mjpeg_q_mode_a */
#define MJPEG_Q_MODE_A_OFFSET     (0x128)
#define MJPEG_FRAME_Q_MODE_A      MJPEG_FRAME_Q_MODE_A
#define MJPEG_FRAME_Q_MODE_A_POS  (0U)
#define MJPEG_FRAME_Q_MODE_A_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_A_MSK  (((1U << MJPEG_FRAME_Q_MODE_A_LEN) - 1) << MJPEG_FRAME_Q_MODE_A_POS)
#define MJPEG_FRAME_Q_MODE_A_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_A_LEN) - 1) << MJPEG_FRAME_Q_MODE_A_POS))

/* 0x12C : mjpeg_q_mode_b */
#define MJPEG_Q_MODE_B_OFFSET     (0x12C)
#define MJPEG_FRAME_Q_MODE_B      MJPEG_FRAME_Q_MODE_B
#define MJPEG_FRAME_Q_MODE_B_POS  (0U)
#define MJPEG_FRAME_Q_MODE_B_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_B_MSK  (((1U << MJPEG_FRAME_Q_MODE_B_LEN) - 1) << MJPEG_FRAME_Q_MODE_B_POS)
#define MJPEG_FRAME_Q_MODE_B_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_B_LEN) - 1) << MJPEG_FRAME_Q_MODE_B_POS))

/* 0x130 : mjpeg_q_mode_c */
#define MJPEG_Q_MODE_C_OFFSET     (0x130)
#define MJPEG_FRAME_Q_MODE_C      MJPEG_FRAME_Q_MODE_C
#define MJPEG_FRAME_Q_MODE_C_POS  (0U)
#define MJPEG_FRAME_Q_MODE_C_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_C_MSK  (((1U << MJPEG_FRAME_Q_MODE_C_LEN) - 1) << MJPEG_FRAME_Q_MODE_C_POS)
#define MJPEG_FRAME_Q_MODE_C_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_C_LEN) - 1) << MJPEG_FRAME_Q_MODE_C_POS))

/* 0x134 : mjpeg_q_mode_d */
#define MJPEG_Q_MODE_D_OFFSET     (0x134)
#define MJPEG_FRAME_Q_MODE_D      MJPEG_FRAME_Q_MODE_D
#define MJPEG_FRAME_Q_MODE_D_POS  (0U)
#define MJPEG_FRAME_Q_MODE_D_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_D_MSK  (((1U << MJPEG_FRAME_Q_MODE_D_LEN) - 1) << MJPEG_FRAME_Q_MODE_D_POS)
#define MJPEG_FRAME_Q_MODE_D_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_D_LEN) - 1) << MJPEG_FRAME_Q_MODE_D_POS))

/* 0x138 : mjpeg_q_mode_e */
#define MJPEG_Q_MODE_E_OFFSET     (0x138)
#define MJPEG_FRAME_Q_MODE_E      MJPEG_FRAME_Q_MODE_E
#define MJPEG_FRAME_Q_MODE_E_POS  (0U)
#define MJPEG_FRAME_Q_MODE_E_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_E_MSK  (((1U << MJPEG_FRAME_Q_MODE_E_LEN) - 1) << MJPEG_FRAME_Q_MODE_E_POS)
#define MJPEG_FRAME_Q_MODE_E_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_E_LEN) - 1) << MJPEG_FRAME_Q_MODE_E_POS))

/* 0x13C : mjpeg_q_mode_f */
#define MJPEG_Q_MODE_F_OFFSET     (0x13C)
#define MJPEG_FRAME_Q_MODE_F      MJPEG_FRAME_Q_MODE_F
#define MJPEG_FRAME_Q_MODE_F_POS  (0U)
#define MJPEG_FRAME_Q_MODE_F_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_F_MSK  (((1U << MJPEG_FRAME_Q_MODE_F_LEN) - 1) << MJPEG_FRAME_Q_MODE_F_POS)
#define MJPEG_FRAME_Q_MODE_F_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_F_LEN) - 1) << MJPEG_FRAME_Q_MODE_F_POS))

/* 0x1F0 : mjpeg_debug */
#define MJPEG_DEBUG_OFFSET           (0x1F0)
#define MJPEG_REG_MJPEG_DBG_EN       MJPEG_REG_MJPEG_DBG_EN
#define MJPEG_REG_MJPEG_DBG_EN_POS   (0U)
#define MJPEG_REG_MJPEG_DBG_EN_LEN   (1U)
#define MJPEG_REG_MJPEG_DBG_EN_MSK   (((1U << MJPEG_REG_MJPEG_DBG_EN_LEN) - 1) << MJPEG_REG_MJPEG_DBG_EN_POS)
#define MJPEG_REG_MJPEG_DBG_EN_UMSK  (~(((1U << MJPEG_REG_MJPEG_DBG_EN_LEN) - 1) << MJPEG_REG_MJPEG_DBG_EN_POS))
#define MJPEG_REG_MJPEG_DBG_SEL      MJPEG_REG_MJPEG_DBG_SEL
#define MJPEG_REG_MJPEG_DBG_SEL_POS  (4U)
#define MJPEG_REG_MJPEG_DBG_SEL_LEN  (4U)
#define MJPEG_REG_MJPEG_DBG_SEL_MSK  (((1U << MJPEG_REG_MJPEG_DBG_SEL_LEN) - 1) << MJPEG_REG_MJPEG_DBG_SEL_POS)
#define MJPEG_REG_MJPEG_DBG_SEL_UMSK (~(((1U << MJPEG_REG_MJPEG_DBG_SEL_LEN) - 1) << MJPEG_REG_MJPEG_DBG_SEL_POS))

/* 0x1FC : mjpeg_dummy_reg */
#define MJPEG_DUMMY_REG_OFFSET (0x1FC)
#define MJPEG_DUMMY_REG        MJPEG_DUMMY_REG
#define MJPEG_DUMMY_REG_POS    (0U)
#define MJPEG_DUMMY_REG_LEN    (32U)
#define MJPEG_DUMMY_REG_MSK    (((1U << MJPEG_DUMMY_REG_LEN) - 1) << MJPEG_DUMMY_REG_POS)
#define MJPEG_DUMMY_REG_UMSK   (~(((1U << MJPEG_DUMMY_REG_LEN) - 1) << MJPEG_DUMMY_REG_POS))

struct mjpeg_reg {
    /* 0x0 : mjpeg_control_1 */
    union {
        struct
        {
            uint32_t reg_mjpeg_enable     : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_mjpeg_bit_order  : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_order_u_even     : 1; /* [    2],        r/w,        0x1 */
            uint32_t reg_wr_over_stop     : 1; /* [    3],        r/w,        0x0 */
            uint32_t reg_last_hf_wblk_dmy : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_last_hf_hblk_dmy : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_reflect_dmy      : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7           : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_h_bust           : 2; /* [ 9: 8],        r/w,        0x3 */
            uint32_t reserved_10_11       : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t reg_yuv_mode         : 2; /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14_15       : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t reg_q_mode           : 7; /* [22:16],        r/w,       0x32 */
            uint32_t reserved_23          : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_y0_order         : 2; /* [25:24],        r/w,        0x0 */
            uint32_t reg_u0_order         : 2; /* [27:26],        r/w,        0x1 */
            uint32_t reg_y1_order         : 2; /* [29:28],        r/w,        0x2 */
            uint32_t reg_v0_order         : 2; /* [31:30],        r/w,        0x3 */
        } BF;
        uint32_t WORD;
    } mjpeg_control_1;

    /* 0x4 : mjpeg_control_2 */
    union {
        struct
        {
            uint32_t reg_sw_frame         : 5;  /* [ 4: 0],        r/w,        0x0 */
            uint32_t reserved_5_7         : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t reg_mjpeg_sw_mode    : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reg_mjpeg_sw_run     : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_11       : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t reg_yy_dvp2ahb_lsel  : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reg_yy_dvp2ahb_fsel  : 1;  /* [   13],        r/w,        0x0 */
            uint32_t reg_uv_dvp2ahb_lsel  : 1;  /* [   14],        r/w,        0x0 */
            uint32_t reg_uv_dvp2ahb_fsel  : 1;  /* [   15],        r/w,        0x0 */
            uint32_t reg_mjpeg_wait_cycle : 16; /* [31:16],        r/w,      0x400 */
        } BF;
        uint32_t WORD;
    } mjpeg_control_2;

    /* 0x08 : mjpeg_yy_frame_addr */
    union {
        struct
        {
            uint32_t reg_yy_addr_start : 32; /* [31: 0],        r/w, 0x80000000L */
        } BF;
        uint32_t WORD;
    } mjpeg_yy_frame_addr;

