bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/mjpeg_reg.h
    /* 0x34 : mjpeg_swap_bit_cnt */
    union {
        struct
        {
            uint32_t frame_swap_end_bit_cnt : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_swap_bit_cnt;

    /* 0x38 : mjpeg_paket_ctrl */
    union {
        struct
        {
            uint32_t reg_pket_en        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_jend_to_pend   : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_15      : 14; /* [15: 2],       rsvd,        0x0 */
            uint32_t reg_pket_body_byte : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_paket_ctrl;

    /* 0x3C : mjpeg_paket_head_tail */
    union {
        struct
        {
            uint32_t reg_pket_head_byte : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_pket_tail_byte : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_paket_head_tail;

    /* 0x40 : mjpeg_Y_frame_read_status_1 */
    union {
        struct
        {
            uint32_t yy_mem_hblk_r  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t yy_frm_hblk_r  : 13; /* [28:16],          r,        0x0 */
            uint32_t reserved_29_31 : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_Y_frame_read_status_1;

    /* 0x44 : mjpeg_Y_frame_read_status_2 */
    union {
        struct
        {
            uint32_t yy_wblk_r      : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t yy_mem_rnd_r   : 8;  /* [23:16],          r,        0x0 */
            uint32_t yy_frm_cnt_r   : 8;  /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_Y_frame_read_status_2;

    /* 0x48 : mjpeg_Y_frame_write_status */
    union {
        struct
        {
            uint32_t yy_mem_hblk_w  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t yy_mem_rnd_w   : 8;  /* [23:16],          r,        0x0 */
            uint32_t yy_frm_cnt_w   : 8;  /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_Y_frame_write_status;

    /* 0x4C : mjpeg_UV_frame_read_status_1 */
    union {
        struct
        {
            uint32_t uv_mem_hblk_r  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t uv_frm_hblk_r  : 13; /* [28:16],          r,        0x0 */
            uint32_t reserved_29_31 : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_UV_frame_read_status_1;

    /* 0x50 : mjpeg_UV_frame_read_status_2 */
    union {
        struct
        {
            uint32_t uv_wblk_r      : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t uv_mem_rnd_r   : 8;  /* [23:16],          r,        0x0 */
            uint32_t uv_frm_cnt_r   : 8;  /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_UV_frame_read_status_2;

    /* 0x54 : mjpeg_UV_frame_write_status */
    union {
        struct
        {
            uint32_t uv_mem_hblk_w  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t uv_mem_rnd_w   : 8;  /* [23:16],          r,        0x0 */
            uint32_t uv_frm_cnt_w   : 8;  /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_UV_frame_write_status;

    /* 0x58  reserved */
    uint8_t RESERVED0x58[40];

    /* 0x80 : mjpeg_start_addr0 */
    union {
        struct
        {
            uint32_t frame_start_addr_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr0;

    /* 0x84 : mjpeg_bit_cnt0 */
    union {
        struct
        {
            uint32_t frame_bit_cnt_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt0;

    /* 0x88 : mjpeg_start_addr1 */
    union {
        struct
        {
            uint32_t frame_start_addr_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr1;

    /* 0x8C : mjpeg_bit_cnt1 */
    union {
        struct
        {
            uint32_t frame_bit_cnt_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt1;

    /* 0x90 : mjpeg_start_addr2 */
    union {
        struct
        {
            uint32_t frame_start_addr_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr2;

    /* 0x94 : mjpeg_bit_cnt2 */
    union {
        struct
        {
            uint32_t frame_bit_cnt_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt2;

    /* 0x98 : mjpeg_start_addr3 */
    union {
        struct
        {
            uint32_t frame_start_addr_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr3;

    /* 0x9C : mjpeg_bit_cnt3 */
    union {
        struct
        {
            uint32_t frame_bit_cnt_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt3;

    /* 0xA0 : mjpeg_start_addr4 */
    union {
        struct
        {
            uint32_t frame_start_addr_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr4;

    /* 0xA4 : mjpeg_bit_cnt4 */
    union {
        struct
        {
            uint32_t frame_bit_cnt_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt4;

    /* 0xA8 : mjpeg_start_addr5 */
    union {
        struct
        {
            uint32_t frame_start_addr_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr5;

    /* 0xAC : mjpeg_bit_cnt5 */
    union {
        struct
        {
            uint32_t frame_bit_cnt_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt5;

    /* 0xB0 : mjpeg_start_addr6 */
    union {
        struct
        {
            uint32_t frame_start_addr_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr6;

    /* 0xB4 : mjpeg_bit_cnt6 */
    union {
        struct
        {
            uint32_t frame_bit_cnt_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt6;

    /* 0xB8 : mjpeg_start_addr7 */
    union {
        struct
        {
            uint32_t frame_start_addr_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr7;

    /* 0xBC : mjpeg_bit_cnt7 */
    union {
        struct
        {
            uint32_t frame_bit_cnt_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt7;

