bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/mjpeg_reg.h
    /* 0xC0 : mjpeg_start_addr_8 */
    union {
        struct
        {
            uint32_t frame_start_addr_8 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr_8;

    /* 0xC4 : mjpeg_bit_cnt_8 */
    union {
        struct
        {
            uint32_t frame_bit_cnt_8 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_8;

    /* 0xC8 : mjpeg_start_addr_9 */
    union {
        struct
        {
            uint32_t frame_start_addr_9 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr_9;

    /* 0xCC : mjpeg_bit_cnt_9 */
    union {
        struct
        {
            uint32_t frame_bit_cnt_9 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_9;

    /* 0xD0 : mjpeg_start_addr_a */
    union {
        struct
        {
            uint32_t frame_start_addr_a : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr_a;

    /* 0xD4 : mjpeg_bit_cnt_a */
    union {
        struct
        {
            uint32_t frame_bit_cnt_a : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_a;

    /* 0xD8 : mjpeg_start_addr_b */
    union {
        struct
        {
            uint32_t frame_start_addr_b : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr_b;

    /* 0xDC : mjpeg_bit_cnt_b */
    union {
        struct
        {
            uint32_t frame_bit_cnt_b : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_b;

    /* 0xE0 : mjpeg_start_addr_c */
    union {
        struct
        {
            uint32_t frame_start_addr_c : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr_c;

    /* 0xE4 : mjpeg_bit_cnt_c */
    union {
        struct
        {
            uint32_t frame_bit_cnt_c : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_c;

    /* 0xE8 : mjpeg_start_addr_d */
    union {
        struct
        {
            uint32_t frame_start_addr_d : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr_d;

    /* 0xEC : mjpeg_bit_cnt_d */
    union {
        struct
        {
            uint32_t frame_bit_cnt_d : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_d;

    /* 0xF0 : mjpeg_start_addr_e */
    union {
        struct
        {
            uint32_t frame_start_addr_e : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr_e;

    /* 0xF4 : mjpeg_bit_cnt_e */
    union {
        struct
        {
            uint32_t frame_bit_cnt_e : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_e;

    /* 0xF8 : mjpeg_start_addr_f */
    union {
        struct
        {
            uint32_t frame_start_addr_f : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr_f;

    /* 0xFC : mjpeg_bit_cnt_f */
    union {
        struct
        {
            uint32_t frame_bit_cnt_f : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_f;

    /* 0x100 : mjpeg_q_mode0 */
    union {
        struct
        {
            uint32_t frame_q_mode_0 : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode0;

    /* 0x104 : mjpeg_q_mode1 */
    union {
        struct
        {
            uint32_t frame_q_mode_1 : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode1;

    /* 0x108 : mjpeg_q_mode2 */
    union {
        struct
        {
            uint32_t frame_q_mode_2 : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode2;

    /* 0x10C : mjpeg_q_mode3 */
    union {
        struct
        {
            uint32_t frame_q_mode_3 : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode3;

    /* 0x110 : mjpeg_q_mode4 */
    union {
        struct
        {
            uint32_t frame_q_mode_4 : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode4;

    /* 0x114 : mjpeg_q_mode5 */
    union {
        struct
        {
            uint32_t frame_q_mode_5 : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode5;

    /* 0x118 : mjpeg_q_mode6 */
    union {
        struct
        {
            uint32_t frame_q_mode_6 : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode6;

    /* 0x11C : mjpeg_q_mode7 */
    union {
        struct
        {
            uint32_t frame_q_mode_7 : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode7;

    /* 0x120 : mjpeg_q_mode_8 */
    union {
        struct
        {
            uint32_t frame_q_mode_8 : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode_8;

    /* 0x124 : mjpeg_q_mode_9 */
    union {
        struct
        {
            uint32_t frame_q_mode_9 : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode_9;

    /* 0x128 : mjpeg_q_mode_a */
    union {
        struct
        {
            uint32_t frame_q_mode_a : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode_a;

